# ContinuousRailFilletCreationParallel Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..ContinuousRailFilletCreationParallel Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Cannot create specified fillet at rail path corner because of the curves are already smoothed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ContinuousRailFilletCreationParallel { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ContinuousRailFilletCreationParallel As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ContinuousRailFilletCreationParallel {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace